# 1
# Апгрейд калькулятора
# Степан использует калькулятор для расчёта суммы и разности чисел, но на
# работе ему требуются не только обычные арифметические действия. Он ничего
# не хочет делать вручную, поэтому решил немного расширить функционал калькулятора.
# Напишите программу, запрашивающую у пользователя число и действие,
# которое нужно сделать с числом: вывести сумму его цифр, максимальную или
# минимальную цифру. Каждое действие оформите в виде отдельной функции, а основную программу зациклите.
# Запрошенные числа должны передаваться в функции суммы, максимума и минимума при помощи аргументов.

def sum(num):
   sums = 0
   while num > 0:
       nums = num % 10
       sums += nums
       num //= 10
   print('Сумма цифр:', sums)

def max(num):
    maxm = 0
    while num > 0:
        nums = num % 10
        if nums > maxm:
            maxm = nums
        num //= 10
    print('Максимальная цифра:', maxm)


def minim(num):
    minm = num % 10
    while num > 0:
        nums = num % 10
        if nums < minm:
            minm = nums
        num //= 10
    print('Минимальная цифра:', minm)

while True:
    num = int(input('Введите число: '))
    dev = input('Введите желаемое действие: 1 - сумма, 2 - максимальная цифра, 3 - минимальная цифра: ')
    if dev == "1":
        sum(num)
    elif dev == "2":
        max(num)
    elif dev == "3":
        minim(num)
    else:
        print('Введена команда не верна!')
