# 1
# Задание №1
# Пользователь вводит строку из четырёх
# или более целых чисел, разделённых символом “/”.
#
# Сформируйте словарь, где:
# второе и третье число являются ключами.
# первое число является значением для первого ключа.
# четвертое и все возможные последующие числа хранятся в кортеже как значения второго ключа.
#
# new_string = "1/12/34/3/67/11"
#
# value_1, key_1, key_2, *value_2 = map(int, new_string.split("/"))
# # print(value_1, key_1, key_2, value_2)
# print({key_1 : value_1, key_2 : tuple(value_2)})

# 2
# Самостоятельно сохраните в переменной строку текста.
# Создайте из строки словарь, где ключ — буква, а значение — код буквы.
# Напишите преобразование в одну строку.

# text = 'fjfhghj ksj jhsfj 24h jgfh'
#
# for_dict = {}
# for key in text:
#     for_dict[key] = ord(key)
# print(for_dict)
#
# for_dict = {key: ord(key) for key in text}
# print((for_dict))
# print({key: ord(key) for key in set(input()) if key.isalpha()})

# 3
# Продолжаем развивать задачу 2.
# Возьмите словарь, который вы получили.
# Сохраните его итераторатор.
# Далее выведите первые 5 пар ключ-значение,
# обращаясь к итератору, а не к словарю.
# my_dict = {'d': 100, 's': 115, 'g': 103, '': 32, '2': 50, '3': 51, '8': 56, '4': 52, '6': 54, '1': 49, '7': 55}
# my_iter = iter(my_dict.items())
# for _ in range(5):
#     print(next(my_iter))

# 4
# Создайте генератор чётных чисел от нуля до 100.
# Из последовательности исключите
# числа, сумма цифр которых равна 8.
# Решение в одну строку.

# generator = (i for i in range(0, 101, 2) if i // 10 + i % 10 != 8 )
# #  второе решение
# generator = (i for i in range(0, 101, 2) if sum(map(int, str(i))) !=8)
# 3 решение
# generator = filter(lambda x: sum(map(int, str(x))) !=8, range(0, 101, 2))
# print(list(generator))

# 5
# ✔ Напишите программу, которая выводит
# на экран числа от 1 до 100.
# ✔ При этом вместо чисел, кратных трем,
# программа должна выводить слово «Fizz»
# ✔ Вместо чисел, кратных пяти — слово «Buzz».
# ✔ Если число кратно и 3, и 5, то программа
# должна выводить слово «FizzBuzz».
# ✔ *Превратите решение в генераторное выражение.

# list_1 = []
#
# for i in range(1, 101):
#     if i % 15 == 0:
#        list_1.append('FizzBuzz')
#     elif i % 3 == 0:
#         list_1.append('Fizz')
#     elif i % 5 == 0:
#         list_1.append('Buzz')
#     else:
#         list_1.append(i)
# print(list_1)
#
# list_2 = ('FizzBuzz' if i % 15 == 0 else 'Fizz' if i % 3 == 0 else 'Buzz' if i % 5 == 0 else i for i in range(1, 101))

# 6
# ✔ Выведите в консоль таблицу умножения
# от 2х2 до 9х10 как на школьной тетрадке.
# ✔ Таблицу создайте в виде однострочного
# генератора, где каждый элемент генератора —
# отдельный пример таблицы умножения.
# ✔ Для вывода результата используйте «принт» без перехода на новую строку.